experiments/results/raw/adaptive-disconnect-01-20260829T034535Z/k6.log
time="2026-08-29T03:45:40Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hls.js
        output: json (/results/k6-metrics.jsonl)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 48s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 18s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 1/5 VUs  01.0s/18.0s

running (02.0s), 1/5 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 1/5 VUs  02.0s/18.0s

running (03.0s), 2/5 VUs, 18 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  03.0s/18.0s

running (04.0s), 2/5 VUs, 28 complete and 0 interrupted iterations
default   [  22% ] 2/5 VUs  04.0s/18.0s

running (05.0s), 2/5 VUs, 38 complete and 0 interrupted iterations
default   [  28% ] 2/5 VUs  05.0s/18.0s

running (06.0s), 2/5 VUs, 47 complete and 0 interrupted iterations
default   [  33% ] 2/5 VUs  06.0s/18.0s

running (07.0s), 2/5 VUs, 57 complete and 0 interrupted iterations
default   [  39% ] 2/5 VUs  07.0s/18.0s

running (08.0s), 2/5 VUs, 67 complete and 0 interrupted iterations
default   [  44% ] 2/5 VUs  08.0s/18.0s

running (09.0s), 3/5 VUs, 78 complete and 0 interrupted iterations
default   [  50% ] 3/5 VUs  09.0s/18.0s

running (10.0s), 4/5 VUs, 95 complete and 0 interrupted iterations
default   [  56% ] 4/5 VUs  10.0s/18.0s

running (11.0s), 5/5 VUs, 119 complete and 0 interrupted iterations
default   [  61% ] 5/5 VUs  11.0s/18.0s

running (12.0s), 5/5 VUs, 141 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  12.0s/18.0s

running (13.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  13.0s/18.0s

running (14.0s), 5/5 VUs, 190 complete and 0 interrupted iterations
default   [  78% ] 5/5 VUs  14.0s/18.0s

running (15.0s), 5/5 VUs, 213 complete and 0 interrupted iterations
default   [  83% ] 5/5 VUs  15.0s/18.0s

running (16.0s), 5/5 VUs, 233 complete and 0 interrupted iterations
default   [  89% ] 5/5 VUs  16.0s/18.0s

running (17.0s), 4/5 VUs, 256 complete and 0 interrupted iterations
default   [  94% ] 4/5 VUs  17.0s/18.0s

running (18.0s), 3/5 VUs, 274 complete and 0 interrupted iterations
default   [ 100% ] 3/5 VUs  18.0s/18.0s


  █ THRESHOLDS 

    hls_playlist_failures
    ✓ 'count>=0' count=0

    hls_segment_failures
    ✓ 'count>=0' count=0

    hls_session_failures
    ✓ 'rate>=0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 831     45.805145/s
    checks_succeeded...: 100.00% 831 out of 831
    checks_failed......: 0.00%   0 out of 831

    ✓ master playlist is 200
    ✓ media playlist is 200
    ✓ segment is 200

    CUSTOM
    hls_playlist_failures..........: 0      0/s
    hls_playlist_requests..........: 554    30.536763/s
    hls_segment_duration...........: avg=7.38ms   min=673.82µs med=1.39ms   max=503.51ms p(90)=3.97ms   p(95)=5.04ms   p(99)=126.5ms 
    hls_segment_failures...........: 0      0/s
    hls_segment_requests...........: 277    15.268382/s
    hls_session_failures...........: 0.00%  0 out of 277
    selected_edge_node.............: 831    45.805145/s

    HTTP
    http_req_duration..............: avg=2.91ms   min=149.91µs med=646.09µs max=503.51ms p(90)=2.9ms    p(95)=4.13ms   p(99)=8.14ms  
      { expected_response:true }...: avg=2.91ms   min=149.91µs med=646.09µs max=503.51ms p(90)=2.9ms    p(95)=4.13ms   p(99)=8.14ms  
    http_req_failed................: 0.00%  0 out of 844
    http_reqs......................: 844    46.521712/s

    EXECUTION
    iteration_duration.............: avg=211.84ms min=202.05ms med=204.59ms max=749.34ms p(90)=210.01ms p(95)=215.56ms p(99)=363.61ms
    iterations.....................: 277    15.268382/s
    vus............................: 3      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 320 MB 18 MB/s
    data_sent......................: 172 kB 9.5 kB/s



running (18.1s), 0/5 VUs, 277 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  18s